NextFOAM-24/tutorials/multiphase/overInterDyMFoam/rigidBodyHull/background/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default        Gauss linear;
    limitedGrad    cellLimited Gauss linear 1;
}

divSchemes
{
    div(rhoPhi,U)       Gauss upwind;
    div(phi,alpha)      Gauss vanLeer;
    div(phirb,alpha)    Gauss linear;

    turbulence          Gauss linearUpwind limitedGrad;
    div(phi,k)          $turbulence;
    div(phi,omega)      $turbulence;
    div(phi,epsilon)    $turbulence;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    pcorr           ;
    p               ;
    yPsi            ;
}

oversetInterpolation
{
   method           trackingInverseDistance;

   searchBoxDivisions
   (
        (500 500 500)
        (500 500 500)
        (500 500 500)
    );

    holeLayers          6;
    useLayer            3;
}

oversetInterpolationSuppressed
{
    grad(p_rgh);
    surfaceIntegrate(phiHbyA);
}

wallDist
{
    method          Poisson;
}


// ************************************************************************* //
